A=[10 12.6 18 20 22;25 21 17 12 8;12 17 23 17 11;11.8 13 17 19 21];

%乐观法“大中取大”
%决策者持最乐观的态度，决策时不放弃任何一个获得最好结果的机会
%愿意承担一定风险的代价去获得最大的利益
[max_A,index]=max(A,[],2);   %各状态最大效益值
[max_A,index]=max(max_A);    %最大效益值的最大值

%悲观法“小中取大” 
%决策者持最悲观的态度，总是把事情估计得很不利
[min_A,index]=min(A,[],2);    %各状态最小效益值
[max_A,index]=max(min_A);     %最小效益值的最大值

%折衷法
%既不悲观，也不乐观，而是通过一个系数，表示决策者对客观条件估计的乐观程度
[max_A,index]=max(A,[],2);    %各状态最大效益值
[min_A,index]=min(A,[],2);    %各状态最小效益值
max_AA=0.5*max_A+0.5*min_A;   %折衷效益值
[max_AA1,index]=max(max_AA);  %折衷效益值的最大值

%等可能法
%以各状态发生的概率相等为假设的期望值决策分析方法
j=[1/5 1/5 1/5 1/5 1/5]';
E1=A*j;                    %期望效益值
[max_Aa,index]=max(E1);    %期望效益值的最大值

%后悔值法
%后悔值是指某状态下的最大效益值与各方案的效益值之差
[max_AA,index]=max(A);  %各方案最大效益值
max_aa=[max_AA;max_AA;max_AA;max_AA];   %构建矩阵
A1=max_aa-A;   %后悔值
[max_A1,index]=max(A1,[],2);    %各状态最大后悔值
[min_A1,index]=min(max_A1); %最大后悔值的最小值